[
  {
    "q": "Installing for 1st time ?",
    "a": "One thing is clear, not everyone is familiar with Linux, at least not enough to feel comfortable to install a Custom Distro like XeroLinux without knowing how it works, that's why I have written a step by step guide. Kindly pay close attention to every part, that is all I ask...",
    "more": "https://forum.xerolinux.xyz/thread-38.html"
  },
    {
    "q": "Wanna learn more about XeroTool ?",
    "a": "One of the best things that comes included in XeroLinux, is a small, yet powerful tool, labeled XertoTool. With it you can configure many aspects of the Distro. From ricing, to tweaking, to installing a variety of useful tools...",
    "more": "https://forum.xerolinux.xyz/thread-79.html"
  },
  {
    "q": "Want to build ISO from Source ?",
    "a": "Some of you might want to build ISO from source to benefit from latest changes, if any, before anyone else. That's why, I have written a guide on how to do just that. Make sure to follow it exactly. Customize it to your liking if need be. Just note that I will not be providing any help with other DEs/WMs.",
    "more": "https://forum.xerolinux.xyz/thread-118.html"
  },
  {
    "q": "Want to auto mount drives on startup ?",
    "a": "This has been asked many times on social, so I wrote a guide describing, how, in case you have multiple drives, you can auto-mount them on startup without needing to enter root password every time, this guide uses Gnome-Disks, the simplest method imo...",
    "more": "https://forum.xerolinux.xyz/thread-95.html"
  },
  {
    "q": "Want to DualBoot with Windows ?",
    "a": "Not everyone can completely switch to Linux, ditching Windows. I do understand that it can still be needed for some stuff related for, say, school or work. That is why, I posted video guides below by Erik Dubois that shouw you how to Dual-Boot Linux+Windows in both same drive or separate ones...",
    "more": "https://forum.xerolinux.xyz/thread-5.html"
  },
  {
    "q": "Wanna learn more about Snapper ?",
    "a": "Snapper, in case you didn't know, is a great method to take quick snapshots of a working system when using the BTRFS FileSystem, should something go wrong easy to restore back to a working one.. Below are guides of it working with a tool called BTRFS-Assistant...",
    "more": "https://forum.xerolinux.xyz/thread-80.html"
  },
  {
    "q": "Stuck with vmlinuz-linux not found ? Fix below.",
    "a": "Sometimes a Kernel update can go wrong, other times you are testing a Custom one and all Hell goes wrong. I have posted videos below, again by Erik that should help you recover from that...",
    "more": "https://forum.xerolinux.xyz/thread-90.html"
  },
  {
    "q": "Issues updating due to failed mirrors (404)?",
    "a": "Ok, sometimes I have to move my Repo(s) around, yeah it happens, which might cause updates to fail, heck even fresh installs of the Distro due to them moving around.. Below are the steps to remedy that sitation, and soon in my tool come May 25th release...",
    "more": "https://forum.xerolinux.xyz/thread-87.html"
  },
    {
    "q": "Issues with Pacman Backend ?",
    "a": "Sometimes Pacman refuses to behave. Mainly with issues related to Keys. Other times with corrupt packages and so on... Below is a link to a thread where I embedded a video by DistroTube going over them with potential fixes...",
    "more": "https://forum.xerolinux.xyz/thread-115.html"
  },
  {
    "q": "Want To Downgrade A Package ?",
    "a": "Not all updates on Arch go smoothly, in rare occasions an update breaks the app or system, nice thing about Arch is its flexibility, and ability to downgrade broken package to a previous version. Below is a guide on how to do just that...",
    "more": "https://forum.xerolinux.xyz/thread-37.html"
  }
]
